---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldLength
source: html/864be2c1-bb2c-32ac-ebbf-5b62f603403d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldLength Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldLength { get; }
```